zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE247/MCXE247_features.h
/* @brief Number of channels. */
#define FSL_FEATURE_FTM_CHANNEL_COUNTn(x) (8)
/* @brief Has counter reset by the selected input capture event (register bits C0SC[ICRST], C1SC[ICRST], ...). */
#define FSL_FEATURE_FTM_HAS_COUNTER_RESET_BY_CAPTURE_EVENT (1)
/* @brief Has extended deadtime value. */
#define FSL_FEATURE_FTM_HAS_EXTENDED_DEADTIME_VALUE (1)
/* @brief Enable pwm output for the module. */
#define FSL_FEATURE_FTM_HAS_ENABLE_PWM_OUTPUT (1)
/* @brief Has half-cycle reload for the module. */
#define FSL_FEATURE_FTM_HAS_HALFCYCLE_RELOAD (1)
/* @brief Has reload interrupt. */
#define FSL_FEATURE_FTM_HAS_RELOAD_INTERRUPT (1)
/* @brief Has reload initialization trigger. */
#define FSL_FEATURE_FTM_HAS_RELOAD_INITIALIZATION_TRIGGER (1)
/* @brief Has DMA support, bitfield CnSC[DMA]. */
#define FSL_FEATURE_FTM_HAS_DMA_SUPPORT (1)
/* @brief If channel 6 is used to generate channel trigger, bitfield EXTTRIG[CH6TRIG]. */
#define FSL_FEATURE_FTM_HAS_CHANNEL6_TRIGGER (1)
/* @brief If channel 7 is used to generate channel trigger, bitfield EXTTRIG[CH7TRIG]. */
#define FSL_FEATURE_FTM_HAS_CHANNEL7_TRIGGER (1)
/* @brief If instance has only TPM function. */
#define FSL_FEATURE_FTM_IS_TPM_ONLY_INSTANCEn(x) (0)
/* @brief Has frequency of the reload opportunities, bitfield CONF[LDFQ]. */
#define FSL_FEATURE_FTM_HAS_CONF_LDFQ_BIT (1)
/* @brief Has filter prescaler. */
#define FSL_FEATURE_FTM_HAS_FILTER_PRESCALER (1)
/* @brief Has fault output state configurable. */
#define FSL_FEATURE_FTM_HAS_FAULT_OUTPUT_STATE (1)
/* @brief Has paired deadtime. */
#define FSL_FEATURE_FTM_HAS_PAIRED_DEADTIME (1)
/* @brief Has PWM dithering. */
#define FSL_FEATURE_FTM_HAS_DITHERING (1)
/* @brief FTM instance has PWM dithering. */
#define FSL_FEATURE_FTM_INSTANCE_HAS_DITHERINGn(x) \
    (((x) == FTM0) ? (0) : \
    (((x) == FTM1) ? (1) : \
    (((x) == FTM2) ? (1) : \
    (((x) == FTM3) ? (0) : \
    (((x) == FTM4) ? (0) : \
    (((x) == FTM5) ? (0) : \
    (((x) == FTM6) ? (0) : \
    (((x) == FTM7) ? (0) : (-1)))))))))
/* @brief Has trigger mode control. */
#define FSL_FEATURE_FTM_HAS_TRIGGER_MODE (1)
/* @brief Has modified combine mode. */
#define FSL_FEATURE_FTM_HAS_MODIFIED_COMBINE_PWM (1)
/* @brief Has configurable channel input state. */
#define FSL_FEATURE_FTM_HAS_CONF_CHIS_BIT (1)
/* @brief Has configurable channel output value. */
#define FSL_FEATURE_FTM_HAS_CONF_CHOV_BIT (1)
/* @brief FTM instance has Quadrature Decoder with input filter. */
#define FSL_FEATURE_FTM_INSTANCE_HAS_QUAD_DECODEn(x) \
    (((x) == FTM0) ? (0) : \
    (((x) == FTM1) ? (1) : \
    (((x) == FTM2) ? (1) : \
    (((x) == FTM3) ? (0) : \
    (((x) == FTM4) ? (0) : \
    (((x) == FTM5) ? (0) : \
    (((x) == FTM6) ? (0) : \
    (((x) == FTM7) ? (0) : (-1)))))))))
/* @brief FTM instance fault input number. */
#define FSL_FEATURE_FTM_INSTANCE_FAULT_INPUT_NUMBERn(x) \
    (((x) == FTM0) ? (4) : \
    (((x) == FTM1) ? (4) : \
    (((x) == FTM2) ? (4) : \
    (((x) == FTM3) ? (4) : \
    (((x) == FTM4) ? (2) : \
    (((x) == FTM5) ? (2) : \
    (((x) == FTM6) ? (2) : \
    (((x) == FTM7) ? (2) : (-1)))))))))
/* @brief Is affected by errata with ID 010856 (FTM: Safe state is not removed from channel outputs after fault condition ends if SWOCTRL is being used to control the pin). */
#define FSL_FEATURE_FTM_HAS_ERRATA_010856 (1)
/* @brief Has no FAULTEN bit field in COMBINE register. */
#define FSL_FEATURE_FTM_HAS_NO_COMBINE_FAULTEN (0)
/* @brief Has no COMBINE1 bit field in COMBINE register (single channel pair device). */
#define FSL_FEATURE_FTM_HAS_NO_COMBINE_COMBINE1 (0)
/* @brief Has no FAULTM bit field in MODE register. */
#define FSL_FEATURE_FTM_HAS_NO_MODE_FAULTM (0)
/* @brief Has no FAULTIE bit field in MODE register. */
#define FSL_FEATURE_FTM_HAS_NO_MODE_FAULTIE (0)
/* @brief Has no FLTCTRL register. */
#define FSL_FEATURE_FTM_HAS_NO_FLTCTRL (0)
/* @brief Has no FAULTF bit field in FMS register. */
#define FSL_FEATURE_FTM_HAS_NO_FMS_FAULTF (0)

/* GPIO module features */

/* @brief Has GPIO attribute checker register (GACR). */
#define FSL_FEATURE_GPIO_HAS_ATTRIBUTE_CHECKER (0)
/* @brief Has GPIO version ID register (VERID). */
#define FSL_FEATURE_GPIO_HAS_VERSION_INFO_REGISTER (0)
/* @brief Has secure/non-secure access protection registers (LOCK, PCNS, PCNP, ICNS, ICNP). */
#define FSL_FEATURE_GPIO_HAS_SECURE_PRIVILEGE_CONTROL (0)
/* @brief Has GPIO port input disable register (PIDR). */
#define FSL_FEATURE_GPIO_HAS_PORT_INPUT_CONTROL (1)
/* @brief Has GPIO interrupt/DMA request/trigger output selection. */
#define FSL_FEATURE_GPIO_HAS_INTERRUPT_CHANNEL_SELECT (0)

/* SAI module features */

/* @brief Receive/transmit FIFO size in item count (register bit fields TCSR[FRDE], TCSR[FRIE], TCSR[FRF], TCR1[TFW], RCSR[FRDE], RCSR[FRIE], RCSR[FRF], RCR1[RFW], registers TFRn, RFRn). */
#define FSL_FEATURE_SAI_FIFO_COUNTn(x) (8)
/* @brief Receive/transmit channel number (register bit fields TCR3[TCE], RCR3[RCE], registers TDRn and RDRn). */
#define FSL_FEATURE_SAI_CHANNEL_COUNTn(x) \
    (((x) == I2S0) ? (4) : \
    (((x) == I2S1) ? (1) : (-1)))
/* @brief Maximum words per frame (register bit fields TCR3[WDFL], TCR4[FRSZ], TMR[TWM], RCR3[WDFL], RCR4[FRSZ], RMR[RWM]). */
#define FSL_FEATURE_SAI_MAX_WORDS_PER_FRAME (16)
/* @brief Has support of combining multiple data channel FIFOs into single channel FIFO (register bit fields TCR3[CFR], TCR4[FCOMB], TFR0[WCP], TFR1[WCP], RCR3[CFR], RCR4[FCOMB], RFR0[RCP], RFR1[RCP]). */
#define FSL_FEATURE_SAI_HAS_FIFO_COMBINE_MODE (1)
/* @brief Has packing of 8-bit and 16-bit data into each 32-bit FIFO word (register bit fields TCR4[FPACK], RCR4[FPACK]). */
#define FSL_FEATURE_SAI_HAS_FIFO_PACKING (1)
/* @brief Configures when the SAI will continue transmitting after a FIFO error has been detected (register bit fields TCR4[FCONT], RCR4[FCONT]). */
#define FSL_FEATURE_SAI_HAS_FIFO_FUNCTION_AFTER_ERROR (1)
/* @brief Configures if the frame sync is generated internally, a frame sync is only generated when the FIFO warning flag is clear or continuously (register bit fields TCR4[ONDEM], RCR4[ONDEM]). */
#define FSL_FEATURE_SAI_HAS_ON_DEMAND_MODE (1)
/* @brief Simplified bit clock source and asynchronous/synchronous mode selection (register bit fields TCR2[CLKMODE], RCR2[CLKMODE]), in comparison with the exclusively implemented TCR2[SYNC,BCS,BCI,MSEL], RCR2[SYNC,BCS,BCI,MSEL]. */
#define FSL_FEATURE_SAI_HAS_CLOCKING_MODE (0)
/* @brief Has register for configuration of the MCLK divide ratio (register bit fields MDR[FRACT], MDR[DIVIDE]). */
#define FSL_FEATURE_SAI_HAS_MCLKDIV_REGISTER (0)
/* @brief Interrupt source number */
#define FSL_FEATURE_SAI_INT_SOURCE_NUM (2)
/* @brief Has register of MCR. */
#define FSL_FEATURE_SAI_HAS_MCR (0)
/* @brief Has bit field MICS of the MCR register. */
#define FSL_FEATURE_SAI_HAS_NO_MCR_MICS (1)
/* @brief Has register of MDR */
#define FSL_FEATURE_SAI_HAS_MDR (0)
/* @brief Has support the BCLK bypass mode when BCLK = MCLK. */
#define FSL_FEATURE_SAI_HAS_BCLK_BYPASS (0)
/* @brief Has DIV bit fields of MCR register (register bit fields MCR[DIV]). */
#define FSL_FEATURE_SAI_HAS_MCR_MCLK_POST_DIV (0)
/* @brief Support Channel Mode (register bit fields TCR4[CHMOD]). */
#define FSL_FEATURE_SAI_HAS_CHANNEL_MODE (1)
/* @brief SAI has FIFO in this soc (register bit fields TCR1[TFW]. */
#define FSL_FEATURE_SAI_HAS_FIFO (1)
/* @brief Support synchronous with another SAI. */
#define FSL_FEATURE_SAI_HAS_SYNC_WITH_ANOTHER_SAI (0)
/* @brief Has Bit Clock Swap option (register bit fields RCR2[BCS]) */
#define FSL_FEATURE_SAI_HAS_BIT_CLOCK_SWAP (0)
/* @brief SAI5 and SAI6 share one irq number. */
#define FSL_FEATURE_SAI_SAI5_SAI6_SHARE_IRQ (0)

